loginom.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-14 Tue 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org375d51f">1. цели</a></li>
<li><a href="#orgaf20168">2. ссылки</a></li>
<li><a href="#org4900c02">3. данные</a></li>
<li><a href="#orgb956508">4. многомерные кубы iQube</a></li>
</ul>
</div>
</div>
<p>
-<b>- mode: Org; fill-column: 100; coding: utf-8; -</b>-
</p>

<p>
Nobo BI - коробочное решение для интегрированного планирования и среда для совместной работы
</p>

<p>
todo Loginom Scorecard Modeler
</p>

<p>
Self-service аналитика - без департамента IT
</p>
<div id="outline-container-org375d51f" class="outline-2">
<h2 id="org375d51f"><span class="section-number-2">1.</span> цели</h2>
<div class="outline-text-2" id="text-1">
<p>
Loginom - достоинства и недостатки. Как и для чего можно будет применить: 1) я лично 2) компания в будущем
</p>

<p>
Провести анализ
</p>
<ol class="org-ol">
<li>"BI инструментов визуализации"</li>
<li>"инструментов упрощающих исследование данных"</li>
<li>"аналогов Loginom без недостатков"</li>
</ol>
</div>
</div>

<div id="outline-container-orgaf20168" class="outline-2">
<h2 id="orgaf20168"><span class="section-number-2">2.</span> ссылки</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Канал ютуб <a href="https://www.youtube.com/channel/UCNSMPWjO_pna_0H4z4oJk1g">https://www.youtube.com/channel/UCNSMPWjO_pna_0H4z4oJk1g</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4900c02" class="outline-2">
<h2 id="org4900c02"><span class="section-number-2">3.</span> данные</h2>
<div class="outline-text-2" id="text-3">
<p>
версия 6.3.3
</p>

<ol class="org-ol">
<li>Алгоритмы
<ul class="org-ul">
<li>богатый набор аналитики данных</li>
</ul></li>
<li>Визуализация</li>
<li>Интеграция</li>

<li>Визуальное проектирование</li>
<li>Просмотр отчетов
<ul class="org-ul">
<li>полиматика</li>
<li>visiolagy</li>
<li>click</li>
</ul></li>
</ol>

<p>
исследование данных
</p>
<ul class="org-ul">
<li>дубликатов - все атрибуты совпадают</li>
<li>противоречеия - выходные отличаются а входные совпадают</li>
</ul>


<p>
Python 3.4 в Loginom
ограничения
</p>
<ul class="org-ul">
<li>один thread</li>
</ul>
</div>
</div>

<div id="outline-container-orgb956508" class="outline-2">
<h2 id="orgb956508"><span class="section-number-2">4.</span> многомерные кубы iQube</h2>
<div class="outline-text-2" id="text-4">
<p>
показатель - ячейка куба
</p>


<p>
Создание куба OLAP
</p>
<ol class="org-ol">
<li>Для одной таблицы можно создать одну группу показателей.</li>
<li>выбираем столбцы и в какие измерения их поместить
<ul class="org-ul">
<li>Для дат создаются отдельные измерения но они почему-то не отображаются
<ul class="org-ul">
<li>Дата поле - это данные с минимальной гранулярностью день.</li>
<li>Дата это особое поле, его не нужно создавать как измерение</li>
</ul></li>
<li>В имерение помещаем несколько атрибутов - колонок загружаемой таблицы</li>
<li>вместо измерения можно указать функцию агрегации - это будут показатели</li>
</ul></li>
<li>Появился загрузчик, таблица и измерения (без дат) и показатели</li>
</ol>

<p>
Перезагружаем Dashboard дезайнер - 
</p>
<ol class="org-ol">
<li>Открываем какой-то 1. редактор сохраненный как файл</li>
<li>вставка-гистограмма</li>
<li>Привязка данных - Источник данных - таблица или VQube</li>
<li>Создаем запрос к данным - выбираем группу показателей</li>
<li>Столбцы - выбираем показатель или показатели</li>
<li>Строки - выбираем несколько измерений</li>
<li>Настройки - Панель фильтров и Drill down - щелкаем использовать Drill Down</li>
<li>На гистограмме первый атрибут измерения с агрегированным показателем, по щелчку открывается
второй аттрибут этого измерений и так далее</li>
</ol>


<p>
строки - по оси X
</p>

<p>
TODO
</p>
<ul class="org-ul">
<li>фильтры и влияния, drill-down, расчетные столбцы;</li>
</ul>


<p>
3 способа  как изменить ограничить данные
</p>
<ol class="org-ol">
<li>График - в привязке данные есть функция добавить фильтр на запрос - жесткий фильтр</li>
<li>Вставка - Фильтр - отображается выше графика</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-01-14 Tue 12:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
